INSERT INTO department (id, name, code, parent_department_fk, med_org_fk, date_open, date_close) 
VALUES 
-- Для ГАУЗ "Клиника медицинского университета"
(1, 'Акушерско-физиологическое отделение ГАУЗ КМУ', '1111', NULL, 1, '2010-01-01', NULL),
(2, 'Гинекологическое отделение ГАУЗ КМУ', '2111', NULL, 1, '2010-01-01', NULL),
(3, 'Дневной стационар гинекологического отделения ГАУЗ КМУ', '3111', 2, 1, '2010-01-01', NULL),
(4, 'Отделение для новорожденных детей ГАУЗ КМУ', '4111', NULL, 1, '2010-01-01', NULL),

-- Для Городской клинической больницы №16
(5, 'ГАУЗ "ГКБ №16" Терапевтическое отделение № 1', '1222', NULL, 2, '2013-11-01', NULL),
(6, 'Роддом Городской клинической больницы № 16', '2222', NULL, 2, '2013-11-01', NULL),
(7, 'Акушерско-физиологическое отделение РКГБ 16', '3222', 6, 2, '2013-11-01', NULL),

-- Для Республиканской клинической больницы №2
(8, 'Клиника с направлениями акушерство и гинекология, диагностика и лабораторная диагностика', '1333', NULL, 3, '2000-01-01', NULL),
(9, 'Лаборатория диагностики №1 РКБ2', '2333', 8, 3, '2000-01-01', NULL),
(10, 'Лаборатория диагностики №2 РКБ2', '3333', 8, 3, '2000-01-01', NULL),
(11, 'РКБ 2 Терапевтическое отделение № 1', '4333', NULL, 3, '2000-01-01', NULL),
(12, 'РКБ 2 Терапевтическое отделение № 2', '5333', NULL, 3, '2000-01-01', NULL),

-- Для Сабинской центральной районной больницы
(13, 'Икшурминская Врачебная амбулатория', '1444', NULL, 4, '2000-09-04', NULL),
(14, 'Лесхозская Врачебная амбулатория', '2444', NULL, 4, '2000-09-04', NULL),
(15, 'Шеморданская участковая больница', '3444', NULL, 4, '2000-09-04', NULL);

-- Пациенты
INSERT INTO patient (id, first_name, last_name, middle_name, birth_date) 
VALUES 
(1, 'Иван', 'Иванов', 'Иванович', '1980-05-15'),
(2, 'Мария', 'Петрова', 'Сергеевна', '1990-08-22'),
(3, 'Алексей', 'Сидоров', 'Алексеевич', '1975-03-10'),
(4, 'Елена', 'Кузнецова', 'Владимировна', '1988-11-30');

-- Документы пациентов
INSERT INTO document (id, series, number, type_fk, patient_fk, date_open, date_close) 
VALUES 
(1, '1234', '567890', 1, 1, '2020-01-01', NULL),
(2, NULL, '987654', 2, 2, '2021-02-15', '2021-05-15'),
(3, '4321', '123456', 3, 3, '2019-06-01', NULL),
(4, NULL, '654321', 1, 4, '2022-03-10', NULL);

-- Медицинские случаи
INSERT INTO medical_case (id, card_number, patient_fk, department_fk, med_org_fk, date_open, date_close) 
VALUES 
(1, 'MC001', 1, 1, 1, '2023-01-10', '2023-01-20'),
(2, 'MC002', 2, 5, 2, '2023-02-15', '2023-02-25'),
(3, 'MC003', 3, 8, 3, '2023-03-05', '2023-03-15'),
(4, 'MC004', 4, 13, 4, '2023-04-01', '2023-04-10');


-- Счета
INSERT INTO accounts  (id, med_org_fk, departments, date_open, date_close) 
VALUES 
(1, 1, ARRAY[1,2,3,4], '2023-01-01', '2023-01-31'),
(2, 2, ARRAY[5,6,7], '2023-02-01', '2023-02-28'),
(3, 3, ARRAY[8,9,10,11,12], '2023-03-01', '2023-03-31'),
(4, 4, ARRAY[13,14,15], '2023-04-01', '2023-04-30');
